In [3]:
import numpy as np
import pandas as pd
import seaborn as sns

In [9]:
resto=sns.load_dataset('tips')
resto

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

# to check the head of the data

In [14]:
resto.head(2)# first five data by default

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [18]:
resto.tail(2)

     total_bill   tip     sex smoker   day    time  size
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [24]:
resto.sample(2)

     total_bill   tip   sex smoker  day    time  size
19        20.65  3.35  Male     No  Sat  Dinner     3
183       23.17  6.50  Male    Yes  Sun  Dinner     4

In [46]:
resto.shape

(244, 7)

In [36]:
resto.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [28]:
type(resto)

pandas.core.frame.DataFrame

In [32]:
type(resto.sex)

pandas.core.series.Series

In [38]:
resto.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [78]:
resto.duplicated().sum()

0

In [42]:
resto[resto.duplicated()]

     total_bill  tip     sex smoker   day   time  size
202        13.0  2.0  Female    Yes  Thur  Lunch     2

In [50]:
resto.drop_duplicates(inplace=True)

In [52]:
resto.shape

(243, 7)

In [54]:
resto.describe()

       total_bill         tip        size
count  243.000000  243.000000  243.000000
mean    19.813868    3.002387    2.572016
std      8.910071    1.385002    0.952356
min      3.070000    1.000000    1.000000
25%     13.380000    2.000000    2.000000
50%     17.810000    2.920000    2.000000
75%     24.175000    3.575000    3.000000
max     50.810000   10.000000    6.000000

In resto dataset avg person spend limit is 19.25 who are visited
in restaurant

In [70]:
resto.describe(include=object)

         sex smoker  day    time
count    243    243  243     243
unique     2      2    4       2
top     Male     No  Sat  Dinner
freq     157    151   87     176

In [66]:
resto.sex=resto.sex.astype(object)
resto.day=resto.day.astype(object)
resto.time=resto.time.astype(object)
resto.smoker=resto.smoker.astype(object)

In [68]:
resto.dtypes

total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size            int64
dtype: object

In [74]:
resto.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [76]:
resto.isnull().sum()/resto.isnull().count()*100

total_bill    0.0
tip           0.0
sex           0.0
smoker        0.0
day           0.0
time          0.0
size          0.0
dtype: float64

In [84]:
data=pd.read_csv("basic_info_missingdata.csv")
data.head()

    Age  Weight (in kg)  Height (in m)
0  45.0            60.0           1.35
1  12.0            43.0           1.21
2  54.0            78.0           1.50
3  26.0            65.0           1.21
4  68.0            50.0           1.32

In [86]:
data.isnull().sum()

Age               1
Weight (in kg)    2
Height (in m)     1
dtype: int64

In [ ]:
# null value replaceing